
;AA11
;オープニングの背景のフェードインテーブル
Table_Opening_PaletteFadein:
	.db $0F, $0F, $0F, $04, $0F, $0F, $0F, $0F, $0F, $0F, $0F, $07, $0F, $0F, $0F, $00
	.db $0F, $0F, $2C, $11, $0F, $0F, $30, $38, $0F, $0F, $0C, $00, $0F, $0F, $0F, $00
	
	.db $0F, $00, $03, $14, $0F, $0F, $01, $00, $0F, $00, $04, $17, $0F, $00, $00, $10
	.db $0F, $0F, $2C, $11, $0F, $0F, $30, $38, $0F, $10, $1C, $01, $0F, $00, $00, $10
;AA51
;オープニングの背景のパレット
Table_Opening_Palette:
	.db $0F, $03, $13, $24, $0F, $0F, $11, $0C, $0F, $04, $14, $27, $0F, $00, $10, $30
	.db $0F, $0F, $2C, $11, $0F, $0F, $30, $38, $0F, $30, $2C, $11, $0F, $00, $10, $30

;AA71
;タイトル画面に行く直前のBGパレット
Table_Opening_PaletteBuilding:
	.db $0F, $0F, $0F, $0F, $0F, $0F, $0F, $0F, $0F, $0F, $0F, $0F, $0F, $00, $10, $30

;AA81
;タイトル画面のパレット
Table_Title_Palette:
	.db $0F, $11, $2C, $15, $0F, $30, $2C, $15, $0F, $26, $27, $15, $0F, $00, $10, $30

;AA91
;タイトル画面のNの部分のスプライトテーブル
Table_Title_Sprites_N:
	.db $2F, $3C, $02, $C0, $37, $3D, $02, $C0, $3F, $3B, $02, $C0, $3F, $3A, $02, $B8
	.db $3F, $39, $02, $B0

;AAA5
;オープニングのビルのスプライト
Table_BuildingSprites:
;窓
	.db $00, $30, $02, $C0, $00, $31, $02, $C8, $08, $32, $02, $C0, $08, $33, $02, $C8
	.db $10, $34, $02, $C0, $10, $35, $02, $C8, $00, $30, $02, $E0, $00, $31, $02, $E8
	.db $08, $32, $02, $E0, $08, $33, $02, $E8, $10, $34, $02, $E0, $10, $35, $02, $E8
;出っ張り
	.db $00, $36, $03, $98, $08, $37, $03, $98, $10, $37, $03, $98, $18, $38, $03, $98

;AAE5
;タイトル画面のロックマンのスプライトptrlo
Table_Title_RockmanSpriteslo:
	.db LOW(Table_Title_RockmanSprites0), LOW(Table_Title_RockmanSprites1)
	.db LOW(Table_Title_RockmanSprites2), LOW(Table_Title_RockmanSprites3)
	.db LOW(Table_Title_RockmanSprites4), LOW(Table_Title_RockmanSprites5)
	.db LOW(Table_Title_RockmanSprites6), LOW(Table_Title_RockmanSprites7)
	.db LOW(Table_Title_RockmanSprites8), LOW(Table_Title_RockmanSprites9)
	.db LOW(Table_Title_RockmanSpritesA), LOW(Table_Title_RockmanSpritesB)
	.db LOW(Table_Title_RockmanSpritesC)
;AAF2
;タイトル画面のロックマンのスプライトptrhi
Table_Title_RockmanSpriteshi:
	.db HIGH(Table_Title_RockmanSprites0), HIGH(Table_Title_RockmanSprites1)
	.db HIGH(Table_Title_RockmanSprites2), HIGH(Table_Title_RockmanSprites3)
	.db HIGH(Table_Title_RockmanSprites4), HIGH(Table_Title_RockmanSprites5)
	.db HIGH(Table_Title_RockmanSprites6), HIGH(Table_Title_RockmanSprites7)
	.db HIGH(Table_Title_RockmanSprites8), HIGH(Table_Title_RockmanSprites9)
	.db HIGH(Table_Title_RockmanSpritesA), HIGH(Table_Title_RockmanSpritesB)
	.db HIGH(Table_Title_RockmanSpritesC)
;AAFF
;タイトル画面のロックマンのスプライトテーブル
Table_Title_RockmanSprites0:
	.db $0B
	.db $00, $00, $01, $C8, $00, $01, $01, $D0, $00, $02, $01, $D8, $08, $03, $00, $C8
	.db $08, $04, $00, $D0, $08, $05, $00, $D8, $08, $1F, $01, $C8, $08, $20, $01, $D0
	.db $10, $06, $00, $C8, $10, $07, $00, $D0, $10, $08, $00, $D8
;AB2C
Table_Title_RockmanSprites1:
	.db $0B
	.db $00, $09, $01, $C8, $00, $0A, $01, $D0, $00, $0B, $01, $D8, $08, $03, $00, $C8
	.db $08, $04, $00, $D0, $08, $05, $00, $D8, $08, $1F, $01, $C8, $08, $20, $01, $D0
	.db $10, $06, $00, $C8, $10, $07, $00, $D0, $10, $08, $00, $D8
;AB59
Table_Title_RockmanSprites2:
	.db $0C
	.db $00, $0C, $01, $C8, $00, $0D, $01, $D0, $00, $02, $01, $D8, $00, $21, $00, $D0
	.db $08, $03, $00, $C8, $08, $04, $00, $D0, $08, $05, $00, $D8, $08, $23, $01, $C8
	.db $08, $24, $01, $D0, $10, $06, $00, $C8, $10, $07, $00, $D0, $10, $08, $00, $D8
;AB8A
Table_Title_RockmanSprites3:
	.db $0C
	.db $00, $0C, $01, $C8, $00, $0E, $01, $D0, $00, $02, $01, $D8, $00, $22, $00, $D0
	.db $08, $03, $00, $C8, $08, $04, $00, $D0, $08, $05, $00, $D8, $08, $23, $01, $C8
	.db $08, $24, $01, $D0, $10, $06, $00, $C8, $10, $07, $00, $D0, $10, $08, $00, $D8
;ABBB
Table_Title_RockmanSprites4:
	.db $0D
	.db $00, $0F, $01, $C8, $00, $10, $01, $D0, $00, $11, $01, $D8, $00, $25, $00, $C8
	.db $00, $26, $00, $D0, $08, $03, $00, $C8, $08, $04, $00, $D0, $08, $05, $00, $D8
	.db $08, $1F, $01, $C8, $08, $20, $01, $D0, $10, $06, $00, $C8, $10, $07, $00, $D0
	.db $10, $08, $00, $D8
;ABF0
Table_Title_RockmanSprites5:
	.db $0A
	.db $00, $12, $00, $C8, $00, $13, $00, $D0, $00, $14, $00, $D8, $08, $03, $00, $C8
	.db $08, $15, $00, $D0, $08, $05, $00, $D8, $10, $06, $00, $C8, $10, $07, $00, $D0
	.db $10, $08, $00, $D8, $06, $27, $01, $CF
;AC19
Table_Title_RockmanSprites6:
	.db $0A
	.db $00, $12, $00, $C8, $00, $16, $00, $D0, $00, $17, $00, $D8, $08, $03, $00, $C8
	.db $08, $18, $00, $D0, $08, $19, $00, $D8, $10, $06, $00, $C8, $10, $07, $00, $D0
	.db $10, $08, $00, $D8, $06, $28, $01, $CF
;AC42
Table_Title_RockmanSprites7:
	.db $0A
	.db $00, $12, $00, $C8, $00, $1A, $00, $D0, $00, $17, $00, $D8, $08, $03, $00, $C8
	.db $08, $1B, $00, $D0, $08, $05, $00, $D8, $10, $06, $00, $C8, $10, $07, $00, $D0
	.db $10, $08, $00, $D8, $06, $28, $01, $CF
;AC6B
Table_Title_RockmanSprites8:
	.db $0A
	.db $00, $1C, $00, $C8, $00, $1D, $00, $D0, $00, $17, $00, $D8, $08, $03, $00, $C8
	.db $08, $18, $00, $D0, $08, $05, $00, $D8, $10, $06, $00, $C8, $10, $07, $00, $D0
	.db $10, $08, $00, $D8, $06, $28, $01, $CF
;AC94
Table_Title_RockmanSprites9:
	.db $0A
	.db $00, $1C, $00, $C8, $00, $1E, $00, $D0, $00, $17, $00, $D8, $08, $03, $00, $C8
	.db $08, $18, $00, $D0, $08, $05, $00, $D8, $10, $06, $00, $C8, $10, $07, $00, $D0
	.db $10, $08, $00, $D8, $06, $28, $01, $CF
;ACBD
Table_Title_RockmanSpritesA:
	.db $04
	.db $F8, $2A, $00, $D0, $00, $2A, $00, $D0, $08, $2A, $00, $D0, $10, $2A, $00, $D0
;ACCE
Table_Title_RockmanSpritesB:
	.db $0A
	.db $F8, $2F, $00, $D0, $00, $2C, $00, $C8, $00, $2D, $00, $D0, $00, $2C, $40, $D8
	.db $08, $2C, $00, $C8, $08, $2D, $00, $D0, $08, $2C, $40, $D8, $10, $2B, $00, $C8
	.db $10, $2E, $00, $D0, $10, $2B, $40, $D8
;ACF7
Table_Title_RockmanSpritesC:
	.db $04
	.db $08, $2F, $00, $D0, $10, $2B, $00, $C8, $10, $2E, $00, $D0, $10, $2B, $40, $D8

;AD08
;オープニングのセリフ
Table_Opening_Quotes:
;200X年- Dr.ライトの生み出した
	.db $A2, $A0, $A0, $D8, $9E, $80, $00, $00, $C4, $DB, $86, $7A, $87, $6A, $88, $6C
	.db $89, $64, $66, $00, $00
;スーパーロボット ロックマン によって
	.db $8A, $80, $8B, $7C, $80, $77, $8C, $7E, $74, $87, $00, $77, $74, $76, $79, $78
	.db $00, $68, $6E, $75, $69
;ナゾの天才科学者Dr.ワイリーの野望は阻止
	.db $8D, $8E, $7E, $6A, $8F, $90, $91, $92, $93, $C4, $DB, $7D, $7A, $7F, $80, $6A
	.db $9A, $9B, $6B, $98, $99
;され 世界に平和がよみがえった。
	.db $67, $73, $00, $94, $95, $68, $82, $9C, $62, $7E, $6E, $6C, $62, $7E, $63, $75
	.db $66, $7B, $00, $00, $00
;しかし、世界征服をたくらむ Dr.ワイリー
	.db $64, $62, $64, $AB, $94, $95, $96, $97, $A8, $66, $65, $70, $6F, $00, $C4, $DB
	.db $7D, $7A, $7F, $80, $00
;は、再び ロックマンに闘いを挑むべく、
	.db $6B, $AB, $81, $A9, $7E, $00, $77, $74, $76, $79, $78, $68, $61, $AA, $A8, $9D
	.db $6F, $6D, $7E, $65, $AB
;新たに造り出した8体のロボットを
	.db $9F, $66, $68, $84, $71, $89, $64, $66, $00, $A1, $85, $6A, $77, $8C, $7E, $74
	.db $87, $A8, $00, $00, $00
;送り出したのである・・・。
	.db $83, $71, $89, $64, $66, $6A, $69, $7E, $60, $72, $DC, $DC, $DC, $7B, $00, $00
	.db $00, $00, $00, $00, $00

;ADB0
;セリフの色変化テーブル
Table_Opening_QuotesColor:
	.db $0F, $00, $10, $20, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30
	.db $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30
	.db $30, $30, $30, $20, $10, $00, $0F

;ADD7
;ロックマンが飛び上がるアニメーションのテーブル
Table_Title_RockmanAnimation:
	.db $0C, $0B, $0A, $06, $06, $09, $09, $08, $08, $07, $07, $06, $06, $06, $06, $06
	.db $06, $05, $05, $04, $04, $03, $03, $02, $02, $01

;ADF1
; 1988 BGテーブル
Table_Opening_1988:
	.db $00, $A7, $A5, $A1, $A1, $00

;ADF7
;CAPCOMBGテーブル
Table_Opening_CAPCOM:
	.db $C3, $C1, $D0, $C3, $CF, $CD

;ADFD
;1988 フェードインテーブル
Table_1988_Fadein:
	.db $0F, $00, $10, $20, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $30, $20
	.db $10, $00, $0F

;AE10
;パスワード画面のパレットテーブル
Table_Password_PaletteData:
	.db $00, $00
Table_Password_Palette:
	.db $0F, $35, $21, $11, $0F, $30, $3C, $21, $0F, $27, $17, $07, $0F, $30, $11, $0C
	.db $0F, $0F, $30, $16, $0F, $0F, $30, $0F, $0F, $30, $30, $30, $0F, $0F, $0F, $0F

;AE32
;...?
Table_UnknownPaletteAE32:
	.db $0F, $26, $26, $27, $0F, $17, $28, $05, $0F, $17, $27, $18, $0F, $19, $2A, $37
	.db $0F, $20, $2C, $11, $0F, $20, $26, $36, $0F, $00, $2C, $11, $0F, $16, $35, $20

;AE52
;PPU書き込み位置、サイズ、データの順でBGに文字列を描くテーブル
Table_Keywords:
; START   
	.db $25, $8C
	.db $09
	.db $40, $53, $54, $41, $52, $54, $40, $40, $40
; PASS WORD
	.db $25, $CC
	.db $0A
	.db $40, $50, $41, $53, $53, $40, $57, $4F, $52, $44
;PASS WORD
	.db $25, $8C
	.db $09
	.db $50, $41, $53, $53, $40, $57, $4F, $52, $44
;ERROR !   
	.db $25, $CC
	.db $0A
	.db $45, $52, $52, $4F, $52, $40, $5F, $40, $40, $40
;CONTINUE
	.db $25, $8B
	.db $08
	.db $43, $4F, $4E, $54, $49, $4E, $55, $45
;STAGE SELECT
	.db $25, $CB
	.db $0C
	.db $53, $54, $41, $47, $45, $40, $53, $45, $4C, $45, $43, $54
;PASS WORD
	.db $26, $0B
	.db $09
	.db $50, $41, $53, $53, $40, $57, $4F, $52, $44
;PRESS A-BUTTON
	.db $22, $66
	.db $0E
	.db $50, $52, $45, $53, $53, $40, $41, $94, $42, $55, $54, $54, $4F, $4E
;PASS WORD
	.db $26, $CA
	.db $09
	.db $50, $41, $53, $53, $40, $57, $4F, $52, $44
;STAGE SELECT
	.db $27, $0A
	.db $0C
	.db $53, $54, $41, $47, $45, $40, $53, $45, $4C, $45, $43, $54
;AED6
;文字列を描くテーブル開始位置
Table_Keywords_ptr:
	.db $00, $0C, $19, $25, $32, $3D, $4C, $58, $69, $75

;AEE0
;カーソルのスプライト
Table_Password_CursorSprite:
	.db $F8, $22, $00, $58

;AEE4
;パスワード入力画面の12345, ABCDE, ●と個数のスプライトテーブル
Table_Password_UISprites:
;12345
	.db $30, $25, $00, $44, $30, $26, $00, $54, $30, $27, $00, $64, $30, $28, $00, $74
	.db $30, $29, $00, $84
;ABCDE
	.db $44, $E1, $02, $30, $54, $E2, $02, $30, $64, $E3, $02, $30, $74, $E4, $02, $30
	.db $84, $E5, $02, $30
;●と個数
	.db $A0, $3F, $00, $D0, $B4, $2D, $01, $D0

;AF14
;パスワード入力画面のカーソル位置とマス目Y
Table_PasswordCursorPositionY:
	.db $40, $40, $40, $40, $40
	.db $50, $50, $50, $50, $50
	.db $60, $60, $60, $60, $60
	.db $70, $70, $70, $70, $70
	.db $80, $80, $80, $80, $80

;AF2D
;パスワード入力画面のカーソル位置とマス目X
Table_PasswordCursorPositionX:
	.db $41, $51, $61, $71, $81
	.db $41, $51, $61, $71, $81
	.db $41, $51, $61, $71, $81
	.db $41, $51, $61, $71, $81
	.db $41, $51, $61, $71, $81

;AF46
;パスワード入力画面のカーソルがどこに移動するか右
Table_PasswordCursorMoveTo_Right:
	.db $01, $02, $03, $04, $00
	.db $06, $07, $08, $09, $05
	.db $0B, $0C, $0D, $0E, $0A
	.db $10, $11, $12, $13, $0F
	.db $15, $16, $17, $18, $14

;AF5F
;パスワード入力画面のカーソルがどこに移動するか左
Table_PasswordCursorMoveTo_Left:
	.db $04, $00, $01, $02, $03
	.db $09, $05, $06, $07, $08
	.db $0E, $0A, $0B, $0C, $0D
	.db $13, $0F, $10, $11, $12
	.db $18, $14, $15, $16, $17

;AF78
;パスワード入力画面のカーソルがどこに移動するか上
Table_PasswordCursorMoveTo_Up:
	.db $14, $15, $16, $17, $18
	.db $00, $01, $02, $03, $04
	.db $05, $06, $07, $08, $09
	.db $0A, $0B, $0C, $0D, $0E
	.db $0F, $10, $11, $12, $13

;AF91
;パスワード入力画面のカーソルがどこに移動するか下
Table_PasswordCursorMoveTo_Down:
	.db $05, $06, $07, $08, $09
	.db $0A, $0B, $0C, $0D, $0E
	.db $0F, $10, $11, $12, $13
	.db $14, $15, $16, $17, $18
	.db $00, $01, $02, $03, $04

;AFAA
;パスワード入力画面のカーソルの点滅する色のテーブル
Table_PasswordCursorColor:
	.db $0F, $00, $10, $20, $30, $20, $10, $00

;AFB2
;パスワード入力画面のカーソルのスプライトテーブル
Table_PasswordCursorSprites:
	.db $00, $3E, $01, $00, $00, $3E, $41, $08
	.db $08, $3E, $81, $00, $08, $3E, $C1, $08

;AFC2
;パスワードの合否判定に使う1
;B1～E5までのマスとボスの種類が対応している
Table_Password_Process1:
	.db $00, $01, $00, $10, $04
	.db $20, $00, $08, $10, $80
	.db $08, $02, $04, $00, $01
	.db $40, $80, $02, $20, $40
;AFD6
;パスワードの合否判定に使う2
;0のマスに置けば倒した扱い、1なら倒していない扱いになる
Table_Password_Process2:
	.db 0, 0, 0, 0, 1
	.db 0, 0, 1, 1, 0
	.db 0, 1, 0, 0, 1
	.db 1, 1, 0, 1, 0

;パスワードのマスとボスの関係をまとめる
;(    ) (H, 0) (    ) (Q, 0) (W, 1)
;(F, 0) (    ) (B, 1) (Q, 1) (C, 0)
;(B, 0) (A, 1) (W, 0) (    ) (H, 1)
;(M, 1) (C, 1) (A, 0) (F, 1) (M, 0)

;AFEA
;パスワード入力後のスプライト
Table_Password_ResultSprite:
	.db $60, $2F, $00, $60, $70, $1F, $00, $60, $60, $1B, $00, $80, $70, $19, $00, $70
	.db $60, $1D, $00, $70, $60, $1C, $00, $90, $70, $1A, $00, $90, $70, $1E, $00, $80
	.db $80, $20, $00, $60, $80, $25, $00, $70, $80, $26, $00, $80, $80, $27, $00, $90

